brew "git"
brew "go-task"
brew "python@3.12"

brew "bat"
brew "dua-cli"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "htop"
brew "neovim"
brew "ripgrep"
brew "sd"
brew "starship"
brew "watch" if OS.mac?
brew "wget"
brew "xh"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh" if OS.linux?
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "awscli" if OS.mac?
brew "poetry" if OS.mac?
brew "postgresql@14", restart_service: true if OS.mac?

brew "kubectl" if OS.mac?
brew "helm" if OS.mac?
brew "derailed/k9s/k9s" if OS.mac?
brew "derailed/popeye/popeye" if OS.mac?

cask "font-fira-code-nerd-font" if OS.mac?
cask "middleclick", args: { no_quarantine: true } if OS.mac?
cask "topnotch" if OS.mac?
cask "wezterm" if OS.mac?
