brew "awscli"
brew "gcc"
brew "git"
brew "go"
brew "go-task"
brew "kubectl"
brew "poetry"
brew "postgresql@14", restart_service: true
brew "python@3.12"

brew "bat"
brew "dua-cli"
brew "delta"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "glow"
brew "gping"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "node@20", link: true
brew "ripgrep"
brew "sd"
brew "starship"
brew "watch" if OS.mac?
brew "wget"
brew "xh"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh" if OS.linux?
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "helm" if OS.mac?
brew "derailed/k9s/k9s" if OS.mac?
brew "derailed/popeye/popeye" if OS.mac?

cask "font-fira-code-nerd-font" if OS.mac?
cask "middleclick", args: { no_quarantine: true } if OS.mac?
cask "topnotch" if OS.mac?
cask "visual-studio-code" if OS.mac?
cask "wezterm" if OS.mac?
