# Taps
tap "derailed/k9s"
tap "derailed/popeye"
tap "hashicorp/tap"

# Core dev dependencies
brew "gcc"
brew "git"
brew "go"
brew "go-task"
brew "node@20", link: true
brew "poetry"
brew "python@3.12", link: true

# Kubernetes
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "helm"
brew "kubectl"

# Other dev dependencies
brew "awscli"
brew "postgresql@14", link: true, restart_service: true

# CLIs
brew "bandwhich"
brew "bat"
brew "bottom"
brew "carapace"
brew "dua-cli"
brew "delta"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "glow"
brew "gping"
brew "hashicorp/tap/terraform"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "poppler"
brew "ripgrep"
brew "sd"
brew "sheldon"
brew "starship"
brew "tealdeer"
brew "watch" if OS.mac?
brew "wget"
brew "xh"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh" if OS.linux?

# Casks
cask "font-fira-code-nerd-font" if OS.mac?
cask "ghostty" if OS.mac?
cask "middleclick", args: { no_quarantine: true } if OS.mac?
cask "topnotch" if OS.mac?
cask "visual-studio-code" if OS.mac?
